In [103]:
#load necessary pakage and libraries
import os
import pandas as pd
import numpy as np
from sklearn.linear_model import LogisticRegression
from sklearn.preprocessing import LabelEncoder
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [104]:
# change directory
os.chdir('../../edvancer/Data/')

In [105]:
pd.set_option('display.max_columns', 40)
inv_data = pd.read_csv('Existing Base.csv')
inv_data.head()

,REF_NO,children,age_band,status,occupation,occupation_partner,home_status,family_income,self_employed,self_employed_partner,year_last_moved,TVarea,post_code,post_area,Average Credit Card Transaction,Balance Transfer,Term Deposit,Life Insurance,Medical Insurance,Average A/C Balance,Personal Loan,Investment in Mutual Fund,Investment Tax Saving Bond,Home Loan,Online Purchase Amount,Revenue Grid,gender,region,Investment in Commudity,Investment in Equity,Investment in Derivative,Portfolio Balance
0,1,Zero,51-55,Partner,Manual Worker,Secretarial/Admin,Own Home,"<17,500, >=15,000",No,No,1972,HTV,NP4 9HS,NP4,148.44,142.95,0.00,81.96,0.00,29.99,0.00,61.95,19.99,0.00,0.00,1,Female,Wales,74.67,18.66,32.32,89.43
1,2,Zero,55-60,Single/Never Married,Retired,Retired,Own Home,"<27,500, >=25,000",No,No,1998,Granada,M41 0QH,M41,0.00,74.98,0.00,25.99,0.00,0.00,0.00,0.00,0.00,0.00,0.00,2,Female,North West,20.19,0.00,4.33,22.78
2,3,Zero,26-30,Single/Never Married,Professional,Other,Own Home,"<30,000, >=27,500",Yes,No,1996,Tyne Tees,NE30 1JZ,NE30,0.00,166.44,20.99,291.37,11.48,166.94,0.00,15.99,0.00,3.49,0.00,2,Male,North,98.06,31.07,80.96,171.78
3,5,Zero,18-21,Single/Never Married,Professional,Manual Worker,Own Home,"<15,000, >=12,500",No,No,1997,Central,HR9 7RJ,HR9,0.00,0.00,0.00,20.49,0.00,39.46,0.00,45.44,0.00,0.00,0.00,2,Female,West Midlands,4.10,14.15,17.57,-41.70
4,6,Zero,45-50,Partner,Business Manager,Unknown,Own Home,"<30,000, >=27,500",No,No,1995,Scottish TV,KA10 7LS,KA10,73.45,57.96,0.00,177.42,41.95,39.47,10.97,212.84,0.00,45.91,25.98,2,Female,Scotland,70.16,55.86,80.44,235.02

In [106]:
inv_data.shape

(10155, 32)

In [107]:
inv_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10155 entries, 0 to 10154
Data columns (total 32 columns):
REF_NO                             10155 non-null int64
children                           10155 non-null object
age_band                           10155 non-null object
status                             10155 non-null object
occupation                         10155 non-null object
occupation_partner                 10155 non-null object
home_status                        10155 non-null object
family_income                      10155 non-null object
self_employed                      10155 non-null object
self_employed_partner              10155 non-null object
year_last_moved                    10155 non-null int64
TVarea                             10155 non-null object
post_code                          10155 non-null object
post_area                          10155 non-null object
Average Credit Card Transaction    10155 non-null float64
Balance Transfer                   10155 non-null float64
Term Deposit                       10155 non-null float64
Life Insurance                     10155 non-null float64
Medical Insurance                  10155 non-null float64
Average A/C Balance                10155 non-null float64
Personal Loan                      10155 non-null float64
Investment in Mutual Fund          10155 non-null float64
Investment Tax Saving Bond         10155 non-null float64
Home Loan                          10155 non-null float64
Online Purchase Amount             10155 non-null float64
Revenue Grid                       10155 non-null int64
gender                             10155 non-null object
region                             10155 non-null object
Investment in Commudity            10155 non-null float64
Investment in Equity               10155 non-null float64
Investment in Derivative           10155 non-null float64
Portfolio Balance                  10155 non-null float64
dtypes: float64(15), int64(3), object(14)
memory usage: 2.5+ MB

In [108]:
inv_data.dtypes

REF_NO                               int64
children                            object
age_band                            object
status                              object
occupation                          object
occupation_partner                  object
home_status                         object
family_income                       object
self_employed                       object
self_employed_partner               object
year_last_moved                      int64
TVarea                              object
post_code                           object
post_area                           object
Average Credit Card Transaction    float64
Balance Transfer                   float64
Term Deposit                       float64
Life Insurance                     float64
Medical Insurance                  float64
Average A/C Balance                float64
Personal Loan                      float64
Investment in Mutual Fund          float64
Investment Tax Saving Bond         float64
Home Loan                          float64
Online Purchase Amount             float64
Revenue Grid                         int64
gender                              object
region                              object
Investment in Commudity            float64
Investment in Equity               float64
Investment in Derivative           float64
Portfolio Balance                  float64
dtype: object

In [109]:
inv_data.isnull().sum()

REF_NO                             0
children                           0
age_band                           0
status                             0
occupation                         0
occupation_partner                 0
home_status                        0
family_income                      0
self_employed                      0
self_employed_partner              0
year_last_moved                    0
TVarea                             0
post_code                          0
post_area                          0
Average Credit Card Transaction    0
Balance Transfer                   0
Term Deposit                       0
Life Insurance                     0
Medical Insurance                  0
Average A/C Balance                0
Personal Loan                      0
Investment in Mutual Fund          0
Investment Tax Saving Bond         0
Home Loan                          0
Online Purchase Amount             0
Revenue Grid                       0
gender                             0
region                             0
Investment in Commudity            0
Investment in Equity               0
Investment in Derivative           0
Portfolio Balance                  0
dtype: int64

In [110]:
inv_data.columns

Index(['REF_NO', 'children', 'age_band', 'status', 'occupation',
       'occupation_partner', 'home_status', 'family_income', 'self_employed',
       'self_employed_partner', 'year_last_moved', 'TVarea', 'post_code',
       'post_area', 'Average Credit Card Transaction', 'Balance Transfer',
       'Term Deposit', 'Life Insurance', 'Medical Insurance',
       'Average A/C Balance', 'Personal Loan', 'Investment in Mutual Fund',
       'Investment Tax Saving Bond', 'Home Loan', 'Online Purchase Amount',
       'Revenue Grid', 'gender', 'region', 'Investment in Commudity',
       'Investment in Equity', 'Investment in Derivative',
       'Portfolio Balance'],
      dtype='object')

In [111]:
#clean the columns names
def clean_col(name):
    name = name.strip().lower().replace(" ", "_")
    return name.replace('/','_')
inv_data = inv_data.rename(columns = clean_col)

In [112]:
inv_data.head()

,ref_no,children,age_band,status,occupation,occupation_partner,home_status,family_income,self_employed,self_employed_partner,year_last_moved,tvarea,post_code,post_area,average_credit_card_transaction,balance_transfer,term_deposit,life_insurance,medical_insurance,average_a_c_balance,personal_loan,investment_in_mutual_fund,investment_tax_saving_bond,home_loan,online_purchase_amount,revenue_grid,gender,region,investment_in_commudity,investment_in_equity,investment_in_derivative,portfolio_balance
0,1,Zero,51-55,Partner,Manual Worker,Secretarial/Admin,Own Home,"<17,500, >=15,000",No,No,1972,HTV,NP4 9HS,NP4,148.44,142.95,0.00,81.96,0.00,29.99,0.00,61.95,19.99,0.00,0.00,1,Female,Wales,74.67,18.66,32.32,89.43
1,2,Zero,55-60,Single/Never Married,Retired,Retired,Own Home,"<27,500, >=25,000",No,No,1998,Granada,M41 0QH,M41,0.00,74.98,0.00,25.99,0.00,0.00,0.00,0.00,0.00,0.00,0.00,2,Female,North West,20.19,0.00,4.33,22.78
2,3,Zero,26-30,Single/Never Married,Professional,Other,Own Home,"<30,000, >=27,500",Yes,No,1996,Tyne Tees,NE30 1JZ,NE30,0.00,166.44,20.99,291.37,11.48,166.94,0.00,15.99,0.00,3.49,0.00,2,Male,North,98.06,31.07,80.96,171.78
3,5,Zero,18-21,Single/Never Married,Professional,Manual Worker,Own Home,"<15,000, >=12,500",No,No,1997,Central,HR9 7RJ,HR9,0.00,0.00,0.00,20.49,0.00,39.46,0.00,45.44,0.00,0.00,0.00,2,Female,West Midlands,4.10,14.15,17.57,-41.70
4,6,Zero,45-50,Partner,Business Manager,Unknown,Own Home,"<30,000, >=27,500",No,No,1995,Scottish TV,KA10 7LS,KA10,73.45,57.96,0.00,177.42,41.95,39.47,10.97,212.84,0.00,45.91,25.98,2,Female,Scotland,70.16,55.86,80.44,235.02

In [113]:
#check pct of missing values in columns
inv_data.isnull().mean()*100

ref_no                             0.0
children                           0.0
age_band                           0.0
status                             0.0
occupation                         0.0
occupation_partner                 0.0
home_status                        0.0
family_income                      0.0
self_employed                      0.0
self_employed_partner              0.0
year_last_moved                    0.0
tvarea                             0.0
post_code                          0.0
post_area                          0.0
average_credit_card_transaction    0.0
balance_transfer                   0.0
term_deposit                       0.0
life_insurance                     0.0
medical_insurance                  0.0
average_a_c_balance                0.0
personal_loan                      0.0
investment_in_mutual_fund          0.0
investment_tax_saving_bond         0.0
home_loan                          0.0
online_purchase_amount             0.0
revenue_grid                       0.0
gender                             0.0
region                             0.0
investment_in_commudity            0.0
investment_in_equity               0.0
investment_in_derivative           0.0
portfolio_balance                  0.0
dtype: float64

In [114]:
inv_data['children'].value_counts()

Zero    6208
1       1848
2       1607
3        473
4+        19
Name: children, dtype: int64

In [115]:
#we can replace the two off variable apropriately and transform to numerical type
inv_data.loc[(inv_data['children'] =='Zero'), 'children'] = '0'
inv_data.loc[(inv_data['children'] =='4+'), 'children'] = '4'
inv_data['children'] = pd.to_numeric(inv_data['children'], errors='coerce')

In [116]:
inv_data['revenue_grid'].value_counts()

2    9069
1    1086
Name: revenue_grid, dtype: int64

In [117]:
inv_data['y'] = np.where(inv_data['revenue_grid'] == 2,0,1)
inv_data = inv_data.drop('revenue_grid',1)

In [118]:
round(inv_data.groupby('age_band').agg({'y':'mean'}),2)

             y
age_band
18-21     0.17
22-25     0.11
26-30     0.11
31-35     0.11
36-40     0.13
41-45     0.11
45-50     0.10
51-55     0.10
55-60     0.11
61-65     0.09
65-70     0.10
71+       0.10
Unknown   0.05

In [119]:
for i in range(len(inv_data)):
    if inv_data['age_band'][i] in ['71+', '65-70','45-50','51-55']:
        inv_data.loc[i,'age_band'] = 'ab_10'
    if inv_data['age_band'][i] in ['22-25','26-30','31-35','41-45','55-60']:
        inv_data.loc[i, 'age_band'] = 'ab_11'
    if inv_data['age_band'][i] == '36-40':
        inv_data.loc[i, 'age_band'] = 'ab_13'
    if inv_data['age_band'][i] == '18-21':
        inv_data.loc[i, 'age_band'] = 'ab_17'
    if inv_data['age_band'][i] == '61-65':
        inv_data.loc[i, 'age_band'] = 'ab_9'
ab_dummies = pd.get_dummies(inv_data['age_band'])
ab_dummies.head()

   Unknown  ab_10  ab_11  ab_13  ab_17  ab_9
0        0      1      0      0      0     0
1        0      0      1      0      0     0
2        0      0      1      0      0     0
3        0      0      0      0      1     0
4        0      1      0      0      0     0

In [120]:
#add it back to the dataframe
inv_data = pd.concat([inv_data,ab_dummies],1)
inv_data = inv_data.drop(['Unknown', 'age_band'],1)

In [121]:
inv_data['status'].value_counts()

Partner                 7709
Single/Never Married    1101
Divorced/Separated       679
Widowed                  618
Unknown                   48
Name: status, dtype: int64

In [122]:
#create dummies for status column
inv_data['st_partner'] = np.where(inv_data['status'] == 'Partner',1,0)
inv_data['st_SNM'] = np.where(inv_data['status'] == 'Single/Never Married',1,0)
inv_data['st_DS'] = np.where(inv_data['status'] == 'Divorced/Separated',1,0 )
inv_data = inv_data.drop(['status'], 1)

In [123]:
round(inv_data['occupation'].value_counts(normalize =True),2)

Professional         0.24
Retired              0.22
Secretarial/Admin    0.18
Housewife            0.12
Business Manager     0.07
Unknown              0.06
Manual Worker        0.05
Other                0.05
Student              0.01
Name: occupation, dtype: float64

In [124]:
#check relationship with the target variable
round(inv_data.groupby('occupation').agg({'y':'mean'}),2)

                      y
occupation
Business Manager   0.12
Housewife          0.09
Manual Worker      0.11
Other              0.11
Professional       0.12
Retired            0.10
Secretarial/Admin  0.11
Student            0.11
Unknown            0.11

In [125]:
#we can now go ahead and club those with similar avg together
for i in range(len(inv_data)):
    if inv_data['occupation'][i] in ['Manual Worker', 'Other','Secretarial/Admin','Student','Unknown']:
        inv_data.loc[i, 'occupation'] = 'occup_sec_adm'
    if inv_data['occupation'][i] in ['Professional','Business Manager']:
        inv_data.loc[i,'occupation'] = 'occup_prof'
    if inv_data['occupation'][i] == 'Retired':
        inv_data.loc[i, 'occupation'] = 'occup_retired'
occ_dummies = pd.get_dummies(inv_data['occupation'])
occ_dummies.head()

   Housewife  occup_prof  occup_retired  occup_sec_adm
0          0           0              0              1
1          0           0              1              0
2          0           1              0              0
3          0           1              0              0
4          0           1              0              0

In [126]:
# add to dataframe
inv_data = pd.concat([inv_data, occ_dummies], 1)
inv_data = inv_data.drop(['Housewife', 'occupation'], 1)

In [131]:
round(inv_data['occupation_partner'].value_counts(normalize = True),2)

Unknown              0.24
Professional         0.20
Retired              0.19
Manual Worker        0.15
Business Manager     0.07
Secretarial/Admin    0.07
Housewife            0.05
Other                0.03
Student              0.00
Name: occupation_partner, dtype: float64

In [133]:
# check relationship with target
round(inv_data.groupby('occupation_partner').agg({'y':'mean'}),2)

                       y
occupation_partner
Business Manager    0.11
Housewife           0.11
Manual Worker       0.11
Other               0.10
Professional        0.11
Retired             0.10
Secretarial/Admin   0.12
Student             0.12
Unknown             0.10

In [135]:
the_11 = ['Business Manager', 'Housewife','Manual Worker','Professional']
the_10 = ['Other','Retired','Unknown']
the_12 = ['Secretarial/Admin','Student']
for i in range(len(inv_data)):
    if inv_data['occupation_partner'][i] in the_11:
        inv_data.loc[i,'occupation_partner'] = 'part_occ_pro'
    if inv_data['occupation_partner'][i] in the_10:
        inv_data.loc[i, 'occupation_partner'] = 'part_occ_unknown'
    if inv_data['occupation_partner'][i] in the_12:
        inv_data.loc[i,'occupation_partner'] = 'part_occ_sec'
part_occ_dummies = pd.get_dummies(inv_data['occupation_partner'])
part_occ_dummies.head()

   part_occ_pro  part_occ_sec  part_occ_unknown
0             0             1                 0
1             0             0                 1
2             0             0                 1
3             1             0                 0
4             0             0                 1

In [136]:
#combine with data frame and drop one
inv_data = pd.concat([inv_data, part_occ_dummies],1)
inv_data = inv_data.drop(['occupation_partner','part_occ_sec'], 1)

In [137]:
inv_data.head()

,ref_no,children,home_status,family_income,self_employed,self_employed_partner,year_last_moved,tvarea,post_code,post_area,average_credit_card_transaction,balance_transfer,term_deposit,life_insurance,medical_insurance,average_a_c_balance,personal_loan,investment_in_mutual_fund,investment_tax_saving_bond,home_loan,...,gender,region,investment_in_commudity,investment_in_equity,investment_in_derivative,portfolio_balance,y,ab_10,ab_11,ab_13,ab_17,ab_9,st_partner,st_SNM,st_DS,occup_prof,occup_retired,occup_sec_adm,part_occ_pro,part_occ_unknown
0,1,0,Own Home,"<17,500, >=15,000",No,No,1972,HTV,NP4 9HS,NP4,148.44,142.95,0.00,81.96,0.00,29.99,0.00,61.95,19.99,0.00,...,Female,Wales,74.67,18.66,32.32,89.43,1,1,0,0,0,0,1,0,0,0,0,1,0,0
1,2,0,Own Home,"<27,500, >=25,000",No,No,1998,Granada,M41 0QH,M41,0.00,74.98,0.00,25.99,0.00,0.00,0.00,0.00,0.00,0.00,...,Female,North West,20.19,0.00,4.33,22.78,0,0,1,0,0,0,0,1,0,0,1,0,0,1
2,3,0,Own Home,"<30,000, >=27,500",Yes,No,1996,Tyne Tees,NE30 1JZ,NE30,0.00,166.44,20.99,291.37,11.48,166.94,0.00,15.99,0.00,3.49,...,Male,North,98.06,31.07,80.96,171.78,0,0,1,0,0,0,0,1,0,1,0,0,0,1
3,5,0,Own Home,"<15,000, >=12,500",No,No,1997,Central,HR9 7RJ,HR9,0.00,0.00,0.00,20.49,0.00,39.46,0.00,45.44,0.00,0.00,...,Female,West Midlands,4.10,14.15,17.57,-41.70,0,0,0,0,1,0,0,1,0,1,0,0,1,0
4,6,0,Own Home,"<30,000, >=27,500",No,No,1995,Scottish TV,KA10 7LS,KA10,73.45,57.96,0.00,177.42,41.95,39.47,10.97,212.84,0.00,45.91,...,Female,Scotland,70.16,55.86,80.44,235.02,0,1,0,0,0,0,1,0,0,1,0,0,0,1